In [2]:
pip install pymysql

Requirement already satisfied: pymysql in c:\users\turac\anaconda3\lib\site-packages (1.0.2)
Note: you may need to restart the kernel to use updated packages.

In [61]:
import pymysql
try:
	conexion = pymysql.connect(host='localhost',
                             user='root',
                             password='',
                             db='employees')
	print("Conexión correcta")
except (pymysql.err.OperationalError, pymysql.err.InternalError) as e:
	print("Ocurrió un error al conectar: ", e)

Conexión correcta

In [62]:
#EJERCICIO N° 1 - Obtener los datos completos de los empleados.

import pandas as pd
import numpy as np

sql = 'SELECT * FROM employees'
df = pd.read_sql_query(sql, con=conexion)
df

        emp_no  birth_date first_name last_name gender   hire_date
0         1000  1985-01-01       Pepe        Pe      M  1985-01-01
1        10001  1953-09-02     Georgi   Facello      M  1986-06-26
2        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
3        10003  1959-12-03      Parto   Bamford      M  1986-08-28
4        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
...        ...         ...        ...       ...    ...         ...
300020  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300021  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300022  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300023  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300024  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300025 rows x 6 columns]

In [ ]:
#EJERCICIO N°2 - Obtener los datos completos de los departamentos.

import pandas as pd
import numpy as np

sql = 'SELECT * FROM departments, dept_emp'
df = pd.read_sql_query(sql, con=conexion)
df

In [ ]:
#EJERCICIO N°3 - Obtener la cantidad de empleados de sexo femnino.
import pandas as pd
import numpy as np

sql = "SELECT * FROM employees WHERE gender = 'F'"
df = pd.read_sql_query(sql, con=conexion)
df

In [77]:
#ELJERCICIO N° 4 - Obtener los empleados que son o han sido "staff". Recordar que es una consulta multi tablas.

sql = "SELECT distinct e.first_name, e.last_name,de.title, de.from_date, de.to_date from titles de inner join employees e on e.emp_no = de.emp_no where de.title = 'Staff' 
order by 1"

SyntaxError: EOL while scanning string literal (<ipython-input-77-2010dd5d53bc>, line 3)

In [73]:
#EJERCICIO N°5 - Agregar el departamento Cienca de Datos.

INSERT INTO departments 'dept_name', dept_no VALUES ("csdd", "Ciencias_de_Datos");

SyntaxError: invalid syntax (<ipython-input-73-3da7cfc58aee>, line 3)

In [ ]:
#EJERCICIO N°6 - Agregar el empleado "Pepe" y hacerlo jefe ("manager") del departamento Cienca de Datos.

INSERT INTO `employees` (emp_no, first_name, last_name, gender, hire_date) VALUES (1000, "Pepe");

In [78]:
#EJERCICIO N°7 - Borrar el empleado "Pepe".
DELETE FROM employees WHERE emp_no=1000;

SyntaxError: invalid syntax (<ipython-input-78-d4426edbd560>, line 2)

In [ ]:
#EJERCICO N°8 - Obtener el promedio de salarios por departamento.

In [ ]:
#EJERCICO N°9 - Compartir el código en Python para crear en MongoDB una base de datos denominada "weatherHistory" y una colección con el mismo nombre. Cargar los datos del archivo csv denominado weatherHistory.csv

import pymongo
import csv
import pandas as pd

#CONEXION  DATABASE MONGO
client = pymongo.MongoClient('localhost',27017)
db = client['weatherHistory']
#CREO MYCOLLECTION
mycollection = db['weatherHistory']

reader = csv.DictReader(open('weatherHistory.csv'))
for row in reader:
    mycollection.insert_one(row)
    print(mycollection)

In [ ]:
#EJERCICO N°10 - Compartir el código en en Python que devuelva la cantidad de registros insertados en la colección anterior

mycollection.count()